In [1]:
import pandas as pd
import numpy as np

In [2]:
test = pd.read_csv('Desktop/orgadatostp2/datos_navent_fiuba/test_final_100k.csv')
test.head()

   id  idaviso idpostulante
0   0   739260       6M9ZQR
1   1   739260       6v1xdL
2   2   739260       ezRKm9
3   3   758580       1Q35ej
4   4   758580       EAN4J6

In [3]:
vistas = pd.read_csv('Desktop/orgadatostp2/datos_procesados/vistas.csv')
vistas = vistas.drop(['timestamp'], axis = 1).rename({'idAviso': 'visitados'}, axis = 1)
vistas.head()

    visitados idpostulante
0  1111780242      YjVJQ6Z
1  1112263876      BmVpYoR
2  1112327963      wVkBzZd
3  1112318643      OqmP9pv
4  1111903673      DrpbXDP

In [4]:
test1 = pd.merge(test,vistas, on='idpostulante', how='left')
test1.head()

   id  idaviso idpostulante     visitados
0   0   739260       6M9ZQR  1.112448e+09
1   0   739260       6M9ZQR  1.112448e+09
2   0   739260       6M9ZQR  1.112464e+09
3   0   739260       6M9ZQR  1.112418e+09
4   0   739260       6M9ZQR  1.112461e+09

In [5]:
len(test1)

7759575

In [6]:
test1 = test1[test1['idaviso'] == test1['visitados']]

In [7]:
len(test1)

67659

In [8]:
test1 = pd.DataFrame(test1.groupby('idpostulante')['visitados'].value_counts()).rename({'visitados':'num_vistas'},axis=1).reset_index()

In [9]:
test1.head()

  idpostulante     visitados  num_vistas
0      0zB0LYv  1.112309e+09           3
1      0zB0v4v  1.112462e+09           1
2      0zB35QY  1.112426e+09           1
3      0zB35QY  1.112466e+09           1
4      0zB4Lbd  1.112464e+09           1

In [10]:
len(test1)

34161

In [11]:
test1 = test1.rename({'visitados':'idaviso'}, axis =1)
test1.head()

  idpostulante       idaviso  num_vistas
0      0zB0LYv  1.112309e+09           3
1      0zB0v4v  1.112462e+09           1
2      0zB35QY  1.112426e+09           1
3      0zB35QY  1.112466e+09           1
4      0zB4Lbd  1.112464e+09           1

In [12]:
test.head()

   id  idaviso idpostulante
0   0   739260       6M9ZQR
1   1   739260       6v1xdL
2   2   739260       ezRKm9
3   3   758580       1Q35ej
4   4   758580       EAN4J6

In [13]:
test_f = pd.merge(test,test1, on=['idaviso','idpostulante'], how='left')
test_f.head()

   id idaviso idpostulante  num_vistas
0   0  739260       6M9ZQR         NaN
1   1  739260       6v1xdL         NaN
2   2  739260       ezRKm9         NaN
3   3  758580       1Q35ej         NaN
4   4  758580       EAN4J6         NaN

In [14]:
test_f['num_vistas'].value_counts().head(10)

1.0     18651
2.0      8849
4.0      2403
3.0      2257
6.0       668
5.0       499
8.0       242
7.0       170
10.0      112
9.0        83
Name: num_vistas, dtype: int64

In [15]:
test_f['num_vistas'] = test_f['num_vistas'].fillna(False)
test_f.head()

   id idaviso idpostulante num_vistas
0   0  739260       6M9ZQR      False
1   1  739260       6v1xdL      False
2   2  739260       ezRKm9      False
3   3  758580       1Q35ej      False
4   4  758580       EAN4J6      False

In [16]:
test_f['num_vistas'] = test_f['num_vistas'].map(lambda x: 0 if not x else x)
test_f.head()

   id idaviso idpostulante  num_vistas
0   0  739260       6M9ZQR         0.0
1   1  739260       6v1xdL         0.0
2   2  739260       ezRKm9         0.0
3   3  758580       1Q35ej         0.0
4   4  758580       EAN4J6         0.0

In [17]:
test_f['num_vistas'].value_counts().head(10)

0.0     65839
1.0     18651
2.0      8849
4.0      2403
3.0      2257
6.0       668
5.0       499
8.0       242
7.0       170
10.0      112
Name: num_vistas, dtype: int64

In [18]:
test_f.to_csv('Desktop/orgadatostp2/numero_vistas_feature.csv', index=False)